In [63]:
import pandas as pd
import numpy as np

In [88]:
df = pd.read_csv("Part2_Materials/Exercises/aapl_fb.csv")

In [89]:
df.head()

         Date        AAPL         FB
0  2015-01-02  109.330002  78.449997
1  2015-01-05  106.250000  77.190002
2  2015-01-06  106.260002  76.150002
3  2015-01-07  107.750000  76.150002
4  2015-01-08  111.889999  78.180000

In [92]:
df["Date"] = pd.to_datetime(df["Date"])

In [95]:
df = df.set_index('Date')

In [102]:
# 2. 
df["AAPL"].loc["13 May 2016"]

90.519997

In [110]:
# 3.
apple_stock_price = df["AAPL"].loc["September 2017"].mean()

both_mean = df.loc["September 2017"].mean()

In [120]:
df["FB"].resample("M").last()

Date
2015-01-31     75.910004
2015-02-28     78.970001
2015-03-31     82.220001
2015-04-30     78.769997
2015-05-31     79.190002
2015-06-30     85.769997
2015-07-31     94.010002
2015-08-31     89.430000
2015-09-30     89.900002
2015-10-31    101.970001
2015-11-30    104.239998
2015-12-31    104.660004
2016-01-31    112.209999
2016-02-29    106.919998
2016-03-31    114.099998
2016-04-30    117.580002
2016-05-31    118.809998
2016-06-30    114.279999
2016-07-31    123.940002
2016-08-31    126.120003
2016-09-30    128.270004
2016-10-31    130.990005
2016-11-30    118.419998
2016-12-31    115.050003
2017-01-31    130.320007
2017-02-28    135.539993
2017-03-31    142.050003
2017-04-30    150.250000
2017-05-31    151.460007
2017-06-30    150.979996
2017-07-31    169.250000
2017-08-31    171.970001
2017-09-30    170.869995
2017-10-31    180.059998
2017-11-30    177.179993
2017-12-31    176.460007
2018-01-31    186.889999
2018-02-28    178.320007
2018-03-31    159.789993
2018-04-30    172.000000
2018-05-31    191.779999
2018-06-30    194.320007
2018-07-31    172.580002
2018-08-31    175.729996
2018-09-30    164.460007
2018-10-31    151.789993
2018-11-30    140.610001
2018-12-31    133.199997
Freq: M, Name: FB, dtype: float64

In [123]:
df_month_mean = df.resample("M").mean()
df_month_mean.head()

                  AAPL         FB
Date
2015-01-31  110.641501  76.721500
2015-02-28  125.432105  76.951053
2015-03-31  125.970908  81.013183
2015-04-30  127.291428  82.091428
2015-05-31  128.761500  79.420000

In [124]:
df_month_mean.loc["April 2015"]

                  AAPL         FB
Date
2015-04-30  127.291428  82.091428

In [125]:
df.resample("W-Fri").last()

                  AAPL          FB
Date
2015-01-02  109.330002   78.449997
2015-01-09  112.010002   77.739998
2015-01-16  105.989998   75.180000
2015-01-23  112.980003   77.830002
2015-01-30  117.160004   75.910004
...                ...         ...
2018-11-30  178.580002  140.610001
2018-12-07  168.490005  137.419998
2018-12-14  165.479996  144.059998
2018-12-21  150.729996  124.949997
2018-12-28  156.229996  133.199997

[209 rows x 2 columns]